# Камень, ножницы, бумага
# Рандомный выбор хода игрока и компьютера, определение победителя

import random

things = ['Камень', 'Бумага', 'Ножницы'] # Доступные варианты

comp_num = random.randint(0, 2) # Компьютер - рандом 0-2
user_num = random.randint(0, 2) # Юзер - рандом 0-2

comp = things[comp_num]
user = things[user_num]

if (comp == 'Камень') and (user == 'Бумага'): # Камень - Бумага = Бумага
    print('Компьютер - ' , comp , '|' , user , ' - !Игрок!')
elif (comp == 'Бумага') and (user == 'Камень'): # Бумага - Камень = Бумага
    print('!Компьютер! - ' , comp , '|' , user , ' - Игрок')

elif (comp == 'Камень') and (user == 'Ножницы'): # Камень - Ножницы = Камень
    print('!Компьютер! - ' , comp , '|' , user , ' - Игрок')
elif (comp == 'Ножницы') and (user == 'Камень'): # Ножницы - Камень = Камень
    print('Компьютер - ' , comp , '|' , user , ' - !Игрок!')

elif (comp == 'Бумага') and (user == 'Ножницы'): # Бумага - Ножницы = Ножницы
    print('Компьютер - ' , comp , '|' , user, ' - !Игрок!')
elif (comp == 'Ножницы') and (user == 'Бумага'): # Ножницы - Бумага = Ножницы
    print('!Компьютер! - ' , comp , '|' , user , ' - Игрок')

elif (comp == user == 'Камень') | (comp == user == 'Бумага') | (comp == user == 'Ножницы'): # Ничья
    print('Компьютер - ' , comp , '|' , user , ' - Игрок')